const Develop_diffIcon = {
  "black": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M7 20.5C7 21.6046 7.89543 22.5 9 22.5L39 22.5C40.1046 22.5 41 21.6046 41 20.5C41 19.3954 40.1046 18.5 39 18.5L9 18.5C7.89543 18.5 7 19.3954 7 20.5Z",
        "fill-rule": "evenodd",
        "fill": "currentColor"
      },
      {
        "d": "M8 42C8 43.1046 8.89543 44 10 44L38 44C39.1046 44 40 43.1046 40 42C40 40.8954 39.1046 40 38 40L10 40C8.89543 40 8 40.8954 8 42Z",
        "fill-rule": "evenodd",
        "fill-opacity": "0.71",
        "fill": "currentColor"
      },
      {
        "d": "M22 36L22 5C22 3.89543 22.8954 3 24 3C25.1046 3 26 3.89543 26 5L26 36C26 37.1046 25.1046 38 24 38C22.8954 38 22 37.1046 22 36Z",
        "fill-rule": "evenodd",
        "fill": "currentColor"
      }
    ]
  },
  "colorful": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M7 20.5C7 21.6046 7.89543 22.5 9 22.5L39 22.5C40.1046 22.5 41 21.6046 41 20.5C41 19.3954 40.1046 18.5 39 18.5L9 18.5C7.89543 18.5 7 19.3954 7 20.5Z",
        "fill-rule": "evenodd",
        "fill": "#0D9E86"
      },
      {
        "d": "M8 42C8 43.1046 8.89543 44 10 44L38 44C39.1046 44 40 43.1046 40 42C40 40.8954 39.1046 40 38 40L10 40C8.89543 40 8 40.8954 8 42Z",
        "fill-rule": "evenodd",
        "fill": "#FF4943"
      },
      {
        "d": "M22 36L22 5C22 3.89543 22.8954 3 24 3C25.1046 3 26 3.89543 26 5L26 36C26 37.1046 25.1046 38 24 38C22.8954 38 22 37.1046 22 36Z",
        "fill-rule": "evenodd",
        "fill": "#0D9E86"
      }
    ]
  },
  "outline": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M22 22.5L22 36C22 37.1046 22.8954 38 24 38C25.1046 38 26 37.1046 26 36L26 22.5L39 22.5C40.1046 22.5 41 21.6046 41 20.5C41 19.3954 40.1046 18.5 39 18.5L26 18.5L26 5C26 3.89543 25.1046 3 24 3C22.8954 3 22 3.89543 22 5L22 18.5L9 18.5C7.89543 18.5 7 19.3954 7 20.5C7 21.6046 7.89543 22.5 9 22.5L22 22.5ZM8 42C8 43.1046 8.89543 44 10 44L38 44C39.1046 44 40 43.1046 40 42C40 40.8954 39.1046 40 38 40L10 40C8.89543 40 8 40.8954 8 42Z",
        "fill-rule": "evenodd",
        "fill": "#000000"
      }
    ]
  }
};
        
        export function getDevelop_diff(mode = 'outline') {
            return Develop_diffIcon[mode] || Develop_diffIcon['outline'];
        }
        
        export const Develop_diffModes = Object.keys(Develop_diffIcon);
        
        // 导出图标数据本身
        export const Develop_diff = Develop_diffIcon;