const Equipment_flashlightIcon = {
  "fill": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M12 8L36 8C37.1 8 38 7.1 38 6C38 4.9 37.1 4 36 4L12 4C10.9 4 10 4.9 10 6C10 7.1 10.9 8 12 8ZM16.0031 22.7L16.0031 42C16.0031 44.21 17.7931 46 20.0031 46L28.0031 46C30.2131 46 32.0031 44.21 32.0031 42L32.0031 22.7L36.9631 16.5C39.0631 13.88 37.1931 10 33.8431 10L14.1631 10C10.8031 10 8.9431 13.88 11.0431 16.5L16.0031 22.7ZM22 26C22 24.9 22.9 24 24 24C25.1 24 26 24.9 26 26L26 30C26 31.1 25.1 32 24 32C22.9 32 22 31.1 22 30L22 26Z",
        "fill-rule": "evenodd",
        "fill": "#000000"
      }
    ]
  },
  "outline": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M12 8L36 8C37.1 8 38 7.1 38 6C38 4.9 37.1 4 36 4L12 4C10.9 4 10 4.9 10 6C10 7.1 10.9 8 12 8ZM16.0031 42L16.0031 22.7L11.0431 16.5C8.9431 13.88 10.8031 10 14.1631 10L33.8431 10C37.1931 10 39.0631 13.88 36.9631 16.5L32.0031 22.7L32.0031 42C32.0031 44.21 30.2131 46 28.0031 46L20.0031 46C17.7931 46 16.0031 44.21 16.0031 42ZM28.0031 22.7L28.0031 42L20.0031 42L20.0031 22.7C20.0031 21.79 19.6931 20.91 19.1231 20.2L14.1631 14L33.8431 14L28.8831 20.2C28.3131 20.91 28.0031 21.79 28.0031 22.7ZM22 26C22 24.9 22.9 24 24 24C25.1 24 26 24.9 26 26L26 30C26 31.1 25.1 32 24 32C22.9 32 22 31.1 22 30L22 26Z",
        "fill-rule": "evenodd",
        "fill": "#000000"
      }
    ]
  }
};
        
        export function getEquipment_flashlight(mode = 'outline') {
            return Equipment_flashlightIcon[mode] || Equipment_flashlightIcon['outline'];
        }
        
        export const Equipment_flashlightModes = Object.keys(Equipment_flashlightIcon);
        
        // 导出图标数据本身
        export const Equipment_flashlight = Equipment_flashlightIcon;