const Equipment_tvIcon = {
  "fill": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M10 4L38 4C42.4183 4 46 7.58172 46 12L46 31C46 35.4183 42.4183 39 38 39L31.4464 39L33.7366 43.0077C34.4985 44.341 33.5357 46 32.0001 46L16.0001 46C14.4644 46 13.5017 44.341 14.2636 43.0077L16.5537 39L10 39C5.58172 39 2 35.4183 2 31L2 12C2 7.58172 5.58172 4 10 4ZM21.1607 39L19.4464 42L28.5537 42L26.8394 39L21.1607 39Z",
        "fill-rule": "evenodd",
        "fill": "#000000"
      }
    ]
  },
  "outline": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M38 4L10 4C5.58172 4 2 7.58172 2 12L2 31C2 35.4183 5.58172 39 10 39L16.5537 39L14.2636 43.0077C13.5017 44.341 14.4644 46 16.0001 46L32.0001 46C33.5357 46 34.4985 44.341 33.7366 43.0077L31.4464 39L38 39C42.4183 39 46 35.4183 46 31L46 12C46 7.58172 42.4183 4 38 4ZM26.8394 39L28.5537 42L19.4464 42L21.1607 39L26.8394 39ZM20.0001 35L38 35C40.2091 35 42 33.2091 42 31L42 12C42 9.79086 40.2091 8 38 8L10 8C7.79086 8 6 9.79086 6 12L6 31C6 33.2091 7.79086 35 10 35L20.0001 35Z",
        "fill-rule": "evenodd",
        "fill": "#000000"
      }
    ]
  }
};
        
        export function getEquipment_tv(mode = 'outline') {
            return Equipment_tvIcon[mode] || Equipment_tvIcon['outline'];
        }
        
        export const Equipment_tvModes = Object.keys(Equipment_tvIcon);
        
        // 导出图标数据本身
        export const Equipment_tv = Equipment_tvIcon;