const Interaction_downloadIcon = {
  "black": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M24 4.00005C22.8954 4.00002 22 4.89542 21.9999 5.99999L21.999 34.75C21.9989 35.8546 22.8943 36.75 23.9989 36.7501C25.1035 36.7501 25.9989 35.8547 25.999 34.7501L25.9999 6.00012C26 4.89555 25.1046 4.00009 24 4.00005Z",
        "fill-rule": "evenodd",
        "fill": "currentColor"
      },
      {
        "d": "M39.4138 23.4146L26.8284 36C25.2663 37.5621 22.7337 37.5621 21.1716 36L8.5868 23.4153L8.5858 23.4142C8.2239 23.0523 8 22.5523 8 22C8 20.8954 8.8954 20 10 20C10.5523 20 11.0523 20.2239 11.4142 20.5858L11.4153 20.5868L24 33.1716L36.5854 20.5861L36.5858 20.5858C36.9477 20.2239 37.4477 20 38 20C39.1046 20 40 20.8954 40 22C40 22.5523 39.7761 23.0523 39.4142 23.4142L39.4138 23.4146Z",
        "fill-rule": "evenodd",
        "fill": "currentColor"
      },
      {
        "d": "M8 42C8 43.1046 8.89543 44 10 44L38 44C39.1046 44 40 43.1046 40 42C40 40.8954 39.1046 40 38 40L10 40C8.89543 40 8 40.8954 8 42Z",
        "fill-rule": "evenodd",
        "fill-opacity": "0.71",
        "fill": "currentColor"
      }
    ]
  },
  "outline": {
    "viewBox": "0 0 48 48",
    "paths": [
      {
        "d": "M22 6.0001L22 31.17L11.42 20.59L11.41 20.59C11.05 20.22 10.55 20 10 20C8.9 20 8 20.9 8 22C8 22.55 8.22 23.05 8.59 23.41L8.59 23.42L21.18 36C22.74 37.56 25.26 37.56 26.82 36L39.41 23.41C39.78 23.05 40 22.55 40 22C40 20.9 39.1 20 38 20C37.45 20 36.95 20.22 36.59 20.59L26 31.1716L26 6.0001C26 4.9001 25.1 4.0001 24 4.0001C22.9 4.0001 22 4.9001 22 6.0001ZM40 42C40 43.1 39.1 44 38 44L10 44C8.9 44 8 43.1 8 42C8 40.9 8.9 40 10 40L38 40C39.1 40 40 40.9 40 42Z",
        "fill-rule": "evenodd",
        "fill": "#000000"
      }
    ]
  }
};
        
        export function getInteraction_download(mode = 'outline') {
            return Interaction_downloadIcon[mode] || Interaction_downloadIcon['outline'];
        }
        
        export const Interaction_downloadModes = Object.keys(Interaction_downloadIcon);
        
        // 导出图标数据本身
        export const Interaction_download = Interaction_downloadIcon;